# PANDAS

In [1]:
import pandas as pd

In [2]:
a = pd.Series([1,2,3,4], index = ['a','b','c','d'])

In [3]:
a.values

array([1, 2, 3, 4], dtype=int64)

In [4]:
type(a.values)

numpy.ndarray

In [5]:
type(a)

pandas.core.series.Series

In [6]:
a.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
a['a']

1

In [8]:
a['a':'c']

a    1
b    2
c    3
dtype: int64

In [9]:
#SERIES

In [10]:
grades = {'A':4, 'B':3}
marks = {'A':85,'B':75}

In [11]:
g = pd.Series(grades)
g.values

array([4, 3], dtype=int64)

In [12]:
m = pd.Series(marks)
m.values

array([85, 75], dtype=int64)

In [13]:
g

A    4
B    3
dtype: int64

In [14]:
m

A    85
B    75
dtype: int64

In [16]:
m['A']

85

In [17]:
#DATAFRAME

In [18]:
d = pd.DataFrame({'marks':m,'grades':g})

In [19]:
d

   marks  grades
A     85       4
B     75       3

In [20]:
d.T

         A   B
marks   85  75
grades   4   3

In [21]:
d.values

array([[85,  4],
       [75,  3]], dtype=int64)

In [22]:
d.values[1,0]

75

In [23]:
d.columns

Index(['marks', 'grades'], dtype='object')

In [24]:
d

   marks  grades
A     85       4
B     75       3

In [25]:
d['scalemarks']= 90*(d['marks']/100)
d

   marks  grades  scalemarks
A     85       4        76.5
B     75       3        67.5

In [26]:
g = d[d['marks']>70]

In [27]:
g

   marks  grades  scalemarks
A     85       4        76.5
B     75       3        67.5

In [28]:
#MISSING VALUES

In [29]:
a = pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}])
a

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [30]:
a.fillna(0)

     a  b    c
0  1.0  2  0.0
1  0.0  3  4.0

In [31]:
a.dropna

<bound method DataFrame.dropna of      a  b    c
0  1.0  2  NaN
1  NaN  3  4.0>

## LOC ILOC
https://www.analyticsvidhya.com/blog/2020/02/loc-iloc-pandas/

In [32]:
a = pd.Series(['a','b','c'],index=[1,3,5])

In [33]:
a[1]

'a'

In [34]:
a[1:3]

3    b
5    c
dtype: object

In [35]:
a.loc[1:3]

1    a
3    b
dtype: object

In [36]:
a.iloc[1:3]

3    b
5    c
dtype: object

In [37]:
d

   marks  grades  scalemarks
A     85       4        76.5
B     75       3        67.5

In [38]:
d.iloc[1,:]

marks         75.0
grades         3.0
scalemarks    67.5
Name: B, dtype: float64

In [39]:
#PRACTICE
import pandas as pd

In [40]:
df = pd.read_csv('https://raw.githubusercontent.com/AISPUBLISHING/Python-Data-Understanding-Data-Visualization/master/Mastering%20Python%20for%20data%20Understanding%20and%20Visualization/adult.data')

In [41]:
df.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [42]:
df.shape

(32560, 15)

In [43]:
df.columns

Index(['39', ' State-gov', ' 77516', ' Bachelors', ' 13', ' Never-married',
       ' Adm-clerical', ' Not-in-family', ' White', ' Male', ' 2174', ' 0',
       ' 40', ' United-States', ' <=50K'],
      dtype='object')

In [44]:
df = pd.read_csv('https://raw.githubusercontent.com/AISPUBLISHING/Python-Data-Understanding-Data-Visualization/master/Mastering%20Python%20for%20data%20Understanding%20and%20Visualization/adult.data',header = None)

In [45]:
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [46]:
df.columns

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64')

In [47]:
df.columns = ['C'+str(x) for x in range(df.shape[1])]
df.columns

Index(['C0', 'C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'C10',
       'C11', 'C12', 'C13', 'C14'],
      dtype='object')

In [48]:
df['C6']

0              Adm-clerical
1           Exec-managerial
2         Handlers-cleaners
3         Handlers-cleaners
4            Prof-specialty
                ...
32556          Tech-support
32557     Machine-op-inspct
32558          Adm-clerical
32559          Adm-clerical
32560       Exec-managerial
Name: C6, Length: 32561, dtype: object

In [49]:
df.loc[:,'C0']

0        39
1        50
2        38
3        53
4        28
         ..
32556    27
32557    40
32558    58
32559    22
32560    52
Name: C0, Length: 32561, dtype: int64

In [50]:
df.loc[:,['C0','C7']]

       C0              C7
0      39   Not-in-family
1      50         Husband
2      38   Not-in-family
3      53         Husband
4      28            Wife
...    ..             ...
32556  27            Wife
32557  40         Husband
32558  58       Unmarried
32559  22       Own-child
32560  52            Wife

[32561 rows x 2 columns]

In [51]:
l = df['C14'].unique() #mengubah bentuk isi dari C14

In [52]:
l[0]

' <=50K'

In [53]:
l[1]

' >50K'

In [54]:
idx = df['C14']==l[0]

In [55]:
df['C14'].loc[idx]=-1
df['C14'].loc[~idx]=1

C:\Users\USER\anaconda3\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [56]:
df['C14']

0        -1
1        -1
2        -1
3        -1
4        -1
         ..
32556    -1
32557     1
32558    -1
32559    -1
32560     1
Name: C14, Length: 32561, dtype: object

In [57]:
df.head()

,C0,C1,C2,C3,C4,C5,C6,C7,C8,C9,C10,C11,C12,C13,C14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,-1
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,-1
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,-1
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,-1
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,-1

In [58]:
df['C1'].unique().size

9

In [59]:
df['C1'].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [60]:
dfd = pd.get_dummies(df,columns=['C1']) #ubah bentuk C1 jadi di pisah2
dfd.shape

(32561, 23)

In [61]:
dfd.columns

Index(['C0', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'C10', 'C11',
       'C12', 'C13', 'C14', 'C1_ ?', 'C1_ Federal-gov', 'C1_ Local-gov',
       'C1_ Never-worked', 'C1_ Private', 'C1_ Self-emp-inc',
       'C1_ Self-emp-not-inc', 'C1_ State-gov', 'C1_ Without-pay'],
      dtype='object')

In [62]:
df['C1'].isnull()

0        False
1        False
2        False
3        False
4        False
         ...
32556    False
32557    False
32558    False
32559    False
32560    False
Name: C1, Length: 32561, dtype: bool

In [63]:
df2 = pd.get_dummies(df,columns = ['C1','C14'])
df2.columns

Index(['C0', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'C10', 'C11',
       'C12', 'C13', 'C1_ ?', 'C1_ Federal-gov', 'C1_ Local-gov',
       'C1_ Never-worked', 'C1_ Private', 'C1_ Self-emp-inc',
       'C1_ Self-emp-not-inc', 'C1_ State-gov', 'C1_ Without-pay', 'C14_-1',
       'C14_1'],
      dtype='object')

In [64]:
dfd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 23 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   C0                    32561 non-null  int64
 1   C2                    32561 non-null  int64
 2   C3                    32561 non-null  object
 3   C4                    32561 non-null  int64
 4   C5                    32561 non-null  object
 5   C6                    32561 non-null  object
 6   C7                    32561 non-null  object
 7   C8                    32561 non-null  object
 8   C9                    32561 non-null  object
 9   C10                   32561 non-null  int64
 10  C11                   32561 non-null  int64
 11  C12                   32561 non-null  int64
 12  C13                   32561 non-null  object
 13  C14                   32561 non-null  object
 14  C1_ ?                 32561 non-null  uint8
 15  C1_ Federal-gov       32561 non-null  uint8
 16  C1_ Local-gov         32561 non-null  uint8
 17  C1_ Never-worked      32561 non-null  uint8
 18  C1_ Private           32561 non-null  uint8
 19  C1_ Self-emp-inc      32561 non-null  uint8
 20  C1_ Self-emp-not-inc  32561 non-null  uint8
 21  C1_ State-gov         32561 non-null  uint8
 22  C1_ Without-pay       32561 non-null  uint8
dtypes: int64(6), object(8), uint8(9)
memory usage: 3.8+ MB

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C0      32561 non-null  int64
 1   C1      32561 non-null  object
 2   C2      32561 non-null  int64
 3   C3      32561 non-null  object
 4   C4      32561 non-null  int64
 5   C5      32561 non-null  object
 6   C6      32561 non-null  object
 7   C7      32561 non-null  object
 8   C8      32561 non-null  object
 9   C9      32561 non-null  object
 10  C10     32561 non-null  int64
 11  C11     32561 non-null  int64
 12  C12     32561 non-null  int64
 13  C13     32561 non-null  object
 14  C14     32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [66]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   C0                    32561 non-null  int64
 1   C2                    32561 non-null  int64
 2   C3                    32561 non-null  object
 3   C4                    32561 non-null  int64
 4   C5                    32561 non-null  object
 5   C6                    32561 non-null  object
 6   C7                    32561 non-null  object
 7   C8                    32561 non-null  object
 8   C9                    32561 non-null  object
 9   C10                   32561 non-null  int64
 10  C11                   32561 non-null  int64
 11  C12                   32561 non-null  int64
 12  C13                   32561 non-null  object
 13  C1_ ?                 32561 non-null  uint8
 14  C1_ Federal-gov       32561 non-null  uint8
 15  C1_ Local-gov         32561 non-null  uint8
 16  C1_ Never-worked      32561 non-null  uint8
 17  C1_ Private           32561 non-null  uint8
 18  C1_ Self-emp-inc      32561 non-null  uint8
 19  C1_ Self-emp-not-inc  32561 non-null  uint8
 20  C1_ State-gov         32561 non-null  uint8
 21  C1_ Without-pay       32561 non-null  uint8
 22  C14_-1                32561 non-null  uint8
 23  C14_1                 32561 non-null  uint8
dtypes: int64(6), object(7), uint8(11)
memory usage: 3.6+ MB

### grouping

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'ProductName':['bulb','fan','bulb','fan'], 
                   'Type': ['a','b','a','a'],
                  'EC': [400.,300.,250.,300.]})
df

  ProductName Type     EC
0        bulb    a  400.0
1         fan    b  300.0
2        bulb    a  250.0
3         fan    a  300.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductName  4 non-null      object
 1   Type         4 non-null      object
 2   EC           4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [69]:
df.groupby(['ProductName']).sum()

                EC
ProductName
bulb         650.0
fan          600.0

In [70]:
df.groupby(['Type']).sum()

         EC
Type
a     950.0
b     300.0

In [71]:
df.groupby(['ProductName']).mean()

                EC
ProductName
bulb         325.0
fan          300.0

In [72]:
df.groupby([df.Type]).sum()

         EC
Type
a     950.0
b     300.0

In [73]:
df.groupby([df.ProductName,df.Type]).sum()

                     EC
ProductName Type
bulb        a     650.0
fan         a     300.0
            b     300.0

In [74]:
df.groupby([df.ProductName,df.Type]).mean()

                     EC
ProductName Type
bulb        a     325.0
fan         a     300.0
            b     300.0

Heirarchical indexing

In [75]:
df

  ProductName Type     EC
0        bulb    a  400.0
1         fan    b  300.0
2        bulb    a  250.0
3         fan    a  300.0

In [76]:
a = [['bulb','bulb','fan','fan','bulb','fan'],
    ['a','b','c','a','b','c']]

index = pd.MultiIndex.from_arrays(a,names = ('product','type'))
df = pd.DataFrame({'EC': [20,30,40,50,60,70]},index=index)

In [77]:
df

              EC
product type
bulb    a     20
        b     30
fan     c     40
        a     50
bulb    b     60
fan     c     70

In [78]:
df.groupby(level=0).sum()

          EC
product
bulb     110
fan      160

In [79]:
df.groupby(level=1).sum()

       EC
type
a      70
b      90
c     110

In [80]:
df.groupby(level="product").sum()

          EC
product
bulb     110
fan      160

In [81]:
df.groupby(level="type").sum()

       EC
type
a      70
b      90
c     110

### Pandas(rolling)

In [82]:
import numpy as np
df = pd.DataFrame({'a': np.random.randint(0,10,5),
                  'b' : np.random.randint(0,10,5),
                  'c' : np.random.randint(0,10,5)})

In [83]:
df

   a  b  c
0  4  8  3
1  4  6  3
2  4  0  1
3  9  1  7
4  7  7  0

In [84]:
df.rolling(2).sum()

      a     b    c
0   NaN   NaN  NaN
1   8.0  14.0  6.0
2   8.0   6.0  4.0
3  13.0   1.0  8.0
4  16.0   8.0  7.0

In [85]:
df.rolling(3).sum()

      a     b     c
0   NaN   NaN   NaN
1   NaN   NaN   NaN
2  12.0  14.0   7.0
3  17.0   7.0  11.0
4  20.0   8.0   8.0

In [86]:
df.rolling(3,min_periods = 1).mean()

          a         b         c
0  4.000000  8.000000  3.000000
1  4.000000  7.000000  3.000000
2  4.000000  4.666667  2.333333
3  5.666667  2.333333  3.666667
4  6.666667  2.666667  2.666667

In [87]:
import seaborn as sns
iris = sns.load_dataset('iris')

In [88]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [89]:
df = iris.drop(['species'],axis = 1)

In [90]:
df

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [91]:
df.rolling(3,min_periods = 1, win_type = 'gaussian').sum(std = 3)

     sepal_length  sepal_width  petal_length  petal_width
0        4.824393     3.310858      1.324343     0.189192
1        9.735201     6.337878      2.724343     0.389192
2       14.170403     9.337928      3.954091     0.578384
3       13.686615     8.970353      4.043282     0.578384
4       13.775807     9.532524      4.054091     0.578384
..            ...          ...           ...          ...
145     19.470453     9.164949     16.200150     6.851414
146     18.997473     8.486565     15.321766     6.462222
147     18.786665     8.175757     14.837978     5.967626
148     18.324493     8.581161     15.037978     5.973030
149     17.929897     9.075757     15.143383     5.894646

[150 rows x 4 columns]

## Pandas Where

In [99]:
#df.where(cond,action)

In [94]:
df = pd.DataFrame(np.arange(10).reshape(5,2),columns = ['A','B'])
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [95]:
df.where(df<5,-df)

   A  B
0  0  1
1  2  3
2  4 -5
3 -6 -7
4 -8 -9

In [96]:
idx =(df<5) | (df%3)

In [97]:
df.where(idx,-df)

   A  B
0  0  1
1  2  3
2  4  5
3 -6  7
4  8 -9

In [98]:
idx

       A      B
0   True   True
1   True   True
2   True   True
3  False   True
4   True  False

## Pandas Clip

In [100]:
#df.clip(lower,upper)

In [102]:
df = pd.DataFrame(np.random.randint(0,50,(5,10)),
                 columns = list('abcdefghij'))
df

    a   b   c   d   e   f   g   h   i   j
0  38  18  15   1  30  22  26  42   0   7
1  20  42  35   3  23  33  27  22  12  20
2  45  21  20  35   1  20  20  37  34   0
3  47  28  21  25  38   4   1  18  14  33
4  33  21  23  26  19  39  34  20  24  30

In [103]:
df.clip(10,30) #bates bawah jd 10 n atas jd 30

    a   b   c   d   e   f   g   h   i   j
0  30  18  15  10  30  22  26  30  10  10
1  20  30  30  10  23  30  27  22  12  20
2  30  21  20  30  10  20  20  30  30  10
3  30  28  21  25  30  10  10  18  14  30
4  30  21  23  26  19  30  30  20  24  30

In [104]:
#similar
df[df<10]=10
df[df>30]=30

## Pandas Merge

In [105]:
#df.merge(df1,df2)

In [106]:
df1 = pd.DataFrame({'e':['b','j','l'],
                   'g':['a','e','e']})
df2 = pd.DataFrame({'e':['l','b','j'],
                   'h':['2003','2004','2005']})

In [107]:
df1

   e  g
0  b  a
1  j  e
2  l  e

In [108]:
df2

   e     h
0  l  2003
1  b  2004
2  j  2005

In [110]:
pd.merge(df1,df2)

   e  g     h
0  b  a  2004
1  j  e  2005
2  l  e  2003

In [111]:
df3 = pd.merge(df1,df2)
df3

   e  g     h
0  b  a  2004
1  j  e  2005
2  l  e  2003

In [112]:
df4 = pd.DataFrame({'g':['a','e','h'],
                   's':['c','g','s']})

In [113]:
pd.merge(df3,df4, on = 'g')

   e  g     h  s
0  b  a  2004  c
1  j  e  2005  g
2  l  e  2003  g

## Pivot Table

In [116]:
#df.pivot_table()

In [117]:
from seaborn import load_dataset

In [119]:
t = load_dataset('titanic')

In [120]:
t.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [122]:
t.rename(columns={'sex':'gender'},inplace = True)

In [123]:
t

,survived,pclass,gender,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [126]:
t.deck.isnull().sum()

688

In [127]:
t.isnull().sum()

survived         0
pclass           0
gender           0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [128]:
t.drop(['deck'],axis = 1, inplace = True)

In [129]:
t

,survived,pclass,gender,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [131]:
t.groupby(['gender','class'])['survived'].mean()

gender  class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [133]:
t.groupby(['gender','class'])['survived'].mean().unstack()

class      First    Second     Third
gender
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [134]:
t.pivot_table('survived',index='gender', columns= 'class', aggfunc='mean')

class      First    Second     Third
gender
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [135]:
t.pivot_table('survived',index='gender', columns= 'class', aggfunc='sum')

class   First  Second  Third
gender
female     91      70     72
male       45      17     47

In [138]:
agepartitions = pd.cut(t['age'],[0,18,80])

In [139]:
agepartitions

0      (18.0, 80.0]
1      (18.0, 80.0]
2      (18.0, 80.0]
3      (18.0, 80.0]
4      (18.0, 80.0]
           ...
886    (18.0, 80.0]
887    (18.0, 80.0]
888             NaN
889    (18.0, 80.0]
890    (18.0, 80.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 80]]

In [141]:
t.pivot_table('survived',['gender',agepartitions],'class')

class               First    Second     Third
gender age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [142]:
farepart = pd.qcut(t['fare'],2)

In [144]:
t.pivot_table('survived',['gender', agepartitions],[farepart, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
gender age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
gender age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

In [147]:
t.pivot_table(index='gender', columns = 'class', 
              aggfunc = {'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
gender
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

## Pandas String

In [148]:
#df.col.str

In [149]:
t.head()

,survived,pclass,gender,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [150]:
t.gender.str.upper()

0        MALE
1      FEMALE
2      FEMALE
3      FEMALE
4        MALE
        ...
886      MALE
887    FEMALE
888    FEMALE
889      MALE
890      MALE
Name: gender, Length: 891, dtype: object

In [151]:
t

,survived,pclass,gender,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [154]:
"abc,fgh,des".split(',')

['abc', 'fgh', 'des']

In [ ]:
#t.col.str.split(',')[-1]

## Pandas DateTime

In [157]:
#pd.to_datetime()

In [158]:
from datetime import datetime

In [159]:
dates = pd.to_datetime([datetime(2020,7,3),'10th of July, 2018','2017-July-19',
                       '10-09-2016','20160305'])

In [161]:
dates

DatetimeIndex(['2020-07-03', '2018-07-10', '2017-07-19', '2016-10-09',
               '2016-03-05'],
              dtype='datetime64[ns]', freq=None)

In [164]:
dates.to_period('D')

PeriodIndex(['2020-07-03', '2018-07-10', '2017-07-19', '2016-10-09',
             '2016-03-05'],
            dtype='period[D]', freq='D')

In [165]:
dates-dates[0]

TimedeltaIndex(['0 days', '-724 days', '-1080 days', '-1363 days',
                '-1581 days'],
               dtype='timedelta64[ns]', freq=None)